
const BANNED_DATA = [

    "管理员", "admin", "Admin", "root", "system", "System", "官方", "客服", 
    "胡飞扬", "谭娟", "爸爸", "妈妈", "网贷", "买烟", 
    "校长", "副校长", "卖烟", "猪", "臭逼", "丑比", "制毒", "黑产", 
    "贱狗", "贱货", "涩情", "色情", "黄片", "鲁冠", "炉管", 
    "学生会", "团委", "撸管", "鹿关", "导管", "倒灌", 
    "扣逼", "扣卡", "撸金", "黄赌", "罂粟", "割腕", "KTV",

    "曹尼玛", "草拟吗", "操你妈", "草泥马", "草你妈", "草拟妈", "草你爹", "草尼爹", "操你爹", 
    "操你妹", "草拟妹", "曹你妹", "操你爸", "爹", "爸", "没母", "轮椅", "筷子", 
    "水泥", "钢筋", "gay", "毒品", "冰毒", "海洛因", "大麻", "K粉", "摇头丸", 
    "赌博", "博彩", "六合彩", "时时彩", "网赌", "荷官", "高利贷", "裸贷", 
    "基佬", "插死你", "叉死你", "网警", "110", "杀人", "砍人", "自杀", "跳楼",

    "傻逼", "沙比", "煞笔", "SB", "sb", "sB", "Sb", "脑残", "智障", "弱智", "白痴", 
    "废物", "垃圾", "去死", "死妈", "NMSL", "nmsl", "cnm", "CNM", "妈的", "滚你妈", 
    "棍尼妈", "操你", "日你", "干你", "贱人", "婊子", "骚货", "烂货", "畜生", "狗日", 
    "杂种", "野种", "孤儿", "全家死", "灵车", "坟头", "暴毙", "猪头", "王八",

    "约炮", "约跑", "一夜情", "带套", "洗脚", "小姐", "鸡", "鸭", "卖淫", "嫖娼", 
    "援交", "包养", "裸聊", "文爱", "磕炮", "AV", "av", "片源", "种子", "福利", 
    "看片", "强奸", "迷药", "催情", "丝袜", "美腿", "淫荡", "高潮", "做爱", 
    "苍井空", "波多野", "3p", "3P", "群交", "乱伦", "麻豆", "91", "互口", "互操", "互曹", "熊系列", "欧美", "非洲",
    "黑奴", "杨凯", "杨恺", "飞猪", "熊科宇", "罗天乐", "万冬梅", "万东梅", "乳汁", "龟头", "乳头", "卖批", "卖皮", "买屁",
    "猪八戒", "看门狗", "精液", "处女", "处男", "同性恋", "死男同", "娘炮", "嬢泡", "嬢炮", "吊", "吃吊", "吃比", "吃币", "扣币", 
    "扣13", "吃13", "艾滋病", "梅毒", "性交", "抱操", "3p", "傻得儿", "干你娘", "鸭子", "喝尿", "娘娘腔", "香蕉视频", "喝酒", "陪酒",
    "配种", "口交", "无套", "抽插", "啪啪啪啪", "甘你", "你妈", "你奶奶", "草拟爸", "操你大爸", "你爹", "你爷爷", "奶奶", "肥头大耳",
    "nmd", "md", "mb", "nmmp", "你妈卖批", "妈卖批", "吗卖批", "仙人板板", "狗熊", "你他妈的", "ntmd", "死母", "美目", "没妈", "丑货",


    "刷单", "无需押金", "办证", 
    "贷款", "套现", "信用卡", "拼多多", "砍一刀", "领红包", "免费送"
];


function checkSensitive(text) {
    if (!text) return false;

    const lowerText = text.toLowerCase();
    
    for (let word of BANNED_DATA) {
        if (lowerText.includes(word.toLowerCase())) {
            return word; 
        }
    }
    return false; 
}